ubuntu@student04:~/seccamp-Z4/0x02/bgp_peer_setup$ docker exec -it R1 vtysh

Hello, this is FRRouting (version 6.0).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

R1# 
R1# ?
  add         Add registration
  clear       Reset functions
  configure   Configuration from vty interface
  copy        Copy from one file to another
  debug       Debugging functions
  disable     Turn off privileged mode command
  enable      Turn on privileged mode command
  end         End current mode and change to enable mode
  exit        Exit current mode and down to previous mode
  find        Find CLI command containing text
  list        Print command list
  mtrace      Multicast trace route to multicast source
  no          Negate a command or set its defaults
  output      Direct vtysh output to file
  ping        Send echo messages
  quit        Exit current mode and down to previous mode
  show        Show running system information
  terminal    Set terminal line parameters
  traceroute  Trace route to destination
  write       Write running configuration to memory, network, or terminal
R1# configure ?
  terminal  Configuration terminal
R1(config)#

R1(config)# router bgp 1
R1(config-router)# bgp router-id 10.255.1.1
R1(config-router)# neighbor 10.255.1.2 remote-as 2
R1(config-router)# !

R2(config)# router bgp 2
R2(config-router)# bgp router-id 10.255.1.2
R2(config-router)# neighbor 10.255.1.1 remote-as 1
R2(config-router)# !

R1# show ip bgp summary       

IPv4 Unicast Summary:
BGP router identifier 10.255.1.1, local AS number 1 vrf-id 0
BGP table version 0
RIB entries 0, using 0 bytes of memory
Peers 1, using 21 KiB of memory

Neighbor        V         AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down State/PfxRcd
10.255.1.2      4          2      10      10        0    0    0 00:07:10            0

Total number of neighbors 1

R1# show ip bgp view    
Defined BGP views:
	(null) (AS1)

R1# show ip bgp neighbors 
BGP neighbor is 10.255.1.2, remote AS 2, local AS 1, external link
Hostname: R2
  BGP version 4, remote router ID 10.255.1.2, local router ID 10.255.1.1
  BGP state = Established, up for 00:12:50
  Last read 00:00:50, Last write 00:00:50
  Hold time is 180, keepalive interval is 60 seconds
  Neighbor capabilities:
    4 Byte AS: advertised and received
    AddPath:
      IPv4 Unicast: RX advertised IPv4 Unicast and received
    Route refresh: advertised and received(old & new)
    Address Family IPv4 Unicast: advertised and received
    Hostname Capability: advertised (name: R1,domain name: n/a) received (name: R2,domain name: n/a)
    Graceful Restart Capabilty: advertised and received
      Remote Restart timer is 120 seconds
      Address families by peer:
        none
  Graceful restart informations:
    End-of-RIB send: IPv4 Unicast
    End-of-RIB received: IPv4 Unicast
  Message statistics:
    Inq depth is 0
    Outq depth is 0
                         Sent       Rcvd
    Opens:                  1          1
    Notifications:          0          0
    Updates:                1          1
    Keepalives:            13         13
    Route Refresh:          0          0
    Capability:             0          0
    Total:                 15         15
  Minimum time between advertisement runs is 0 seconds

 For address family: IPv4 Unicast
  Update group 1, subgroup 1
  Packet Queue length 0
  Community attribute sent to this neighbor(all)
  0 accepted prefixes

  Connections established 1; dropped 0
  Last reset never
Local host: 10.255.1.1, Local port: 179
Foreign host: 10.255.1.2, Foreign port: 58608
Nexthop: 10.255.1.1
Nexthop global: ::
Nexthop local: ::
BGP connection: shared network
BGP Connect Retry Timer in Seconds: 120
Read thread: on  Write thread: on


R2# show ip bgp summary 

IPv4 Unicast Summary:
BGP router identifier 10.255.1.2, local AS number 2 vrf-id 0
BGP table version 0
RIB entries 0, using 0 bytes of memory
Peers 1, using 21 KiB of memory

Neighbor        V         AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down State/PfxRcd
10.255.1.1      4          1      11      11        0    0    0 00:08:52            0

Total number of neighbors 1

R2# show ip bgp view    
Defined BGP views:
	(null) (AS2)

R2# show ip bgp neighbors 
BGP neighbor is 10.255.1.1, remote AS 1, local AS 2, external link
Hostname: R1
  BGP version 4, remote router ID 10.255.1.1, local router ID 10.255.1.2
  BGP state = Established, up for 00:11:46
  Last read 00:00:46, Last write 00:00:46
  Hold time is 180, keepalive interval is 60 seconds
  Neighbor capabilities:
    4 Byte AS: advertised and received
    AddPath:
      IPv4 Unicast: RX advertised IPv4 Unicast and received
    Route refresh: advertised and received(old & new)
    Address Family IPv4 Unicast: advertised and received
    Hostname Capability: advertised (name: R2,domain name: n/a) received (name: R1,domain name: n/a)
    Graceful Restart Capabilty: advertised and received
      Remote Restart timer is 120 seconds
      Address families by peer:
        none
  Graceful restart informations:
    End-of-RIB send: IPv4 Unicast
    End-of-RIB received: IPv4 Unicast
  Message statistics:
    Inq depth is 0
    Outq depth is 0
                         Sent       Rcvd
    Opens:                  1          1
    Notifications:          0          0
    Updates:                1          1
    Keepalives:            12         12
    Route Refresh:          0          0
    Capability:             0          0
    Total:                 14         14
  Minimum time between advertisement runs is 0 seconds

 For address family: IPv4 Unicast
  Update group 1, subgroup 1
  Packet Queue length 0
  Community attribute sent to this neighbor(all)
  0 accepted prefixes

  Connections established 1; dropped 0
  Last reset never
Local host: 10.255.1.2, Local port: 58608
Foreign host: 10.255.1.1, Foreign port: 179
Nexthop: 10.255.1.2
Nexthop global: ::
Nexthop local: ::
BGP connection: shared network
BGP Connect Retry Timer in Seconds: 120
Read thread: on  Write thread: on

